#เขียนโปรแกรม รับชื่อ อายุ ทางแป้นพิมพ์ แล้วแสดงผลออกมาว่า ชื่อ อายุนัน้ เป็น เด็ก หรือคนแก่
#อายน้อนกว่า 18 คือ เด็ก / อายุ19-45 คนหนุ่ม /46 ขึ้นไปคือคนแก่

# หาฟีเจอร์การทำงาน เพื่อจะเอาไปเขียนแป้นฟังก์ชั่น
# ฟีเจอร์ รับค่าข้อมูล , ตรวจสอบแสดงความเป็น เด็ก  คนหนุ่ม คนแก่ , แสดงซื้อโปรแกรม

def ShowProgramName() :
    print('***-โปรแกรมตรวจสอบและแสดงผลเป็นเด็ก คนหนุ่ม คนแก่-***')

def inputData( ) :
    name = input('ป้อนชื่อ : ')
    age = int(input('ป้อนอายุ : '))
    return name,age

def checkShowStatus( name, age ) :
    if age <= 18 :
        print(f'คุณ {name} อายุ {age} ปี เป็นเด็ก')  
    elif age >=19 and age <=45 :
        print(f'คุณ {name} อายุ {age} ปี เป็นคนหนุ่ม')
    else :
        print(f'คุณ {name} อายุ {age} ปี เป็นคนแก่')

print('-------------------------------------')
ShowProgramName()
print('-------------------------------------')
name, age = inputData()
print('-------------------------------------')
checkShowStatus( name, age)
print('-------------------------------------')